# Pandas Tutorial

Following [[Pandas Tutorial 2021]] by [[Derek Banas]] on [[Derek Banas (YT channel)]]

(But using hy-lang rather than python)

In [1]:
; Imports
(import numpy :as np)
(import pandas :as pd)

## Series

In [2]:
; Create a Pandas Series using two lists, one for the data and one for the index
(setv list1 ["a" "b" "c" "d"])
(setv labels [1, 2, 3, 4])

(setv ser_1 (pd.Series :data list1 :index labels))

ser_1

1    a
2    b
3    c
4    d
dtype: object

In [3]:
; Create a Pandas Series directly from a numpy array-- indices default to 0 indexed
(setv arr_1 (np.array [1, 2, 3, 4]))
(setv ser_2 (pd.Series arr_1))

ser_2

0    1
1    2
2    3
3    4
dtype: int32

In [4]:
; Arithmetic operations on Pandas series default to array operations
(setv ser_3 (pd.Series (. np (array [5, 6, 7, 8]))))

(+ ser_2 ser_3)

0     6
1     8
2    10
3    12
dtype: int32

In [5]:
; Series key on index when performing array operations
; - In this case, the index 3 gets added, but the others don't because they have nothing to match up with
(setv ser_4 (pd.Series :data [5, 6, 7, 8] :index [3, 4, 5, 6]))
(setv ser_5 (pd.Series :data [1 2 3 4] :index [0 1 2 3]))

(print ser_4)
(print ser_5)

(+ ser_4 ser_5)

3    5
4    6
5    7
6    8
dtype: int64
0    1
1    2
2    3
3    4
dtype: int64

0    NaN
1    NaN
2    NaN
3    9.0
4    NaN
5    NaN
6    NaN
dtype: float64

In [6]:
; Create a Pandas Series directly from a python dict
(setv dict_1 {:f_name "Caleb" :l_name "Figgers" :age 31})

(setv ser_6 (pd.Series dict_1))
ser_6

:f_name      Caleb
:l_name    Figgers
:age            31
dtype: object

In [7]:
; Accessing data from series
(get ser_6 0) 

; (get ser_3 :l_name) 
; => Doesn't work.

'Caleb'

In [8]:
(setv dict2 {"a" 1 "b" 2})
(setv ser_7 (pd.Series dict2 :name "a_named_series"))

(print ser_7)
(get ser_7 "a")

a    1
b    2
Name: a_named_series, dtype: int64

1

In [86]:
; Access a pandas Series as a pandas array
ser_7.array

<PandasArray>
[1, 2]
Length: 2, dtype: int64

## DataFrames

### Creating DataFrames

In [9]:
; Create a DataFrame from a two-dimensional Numpy array
(setv arr_2 (np.random.randint 10 50 :size #(2 3)))

; Provide row and column labels by passing lists
(setv df_1 (pd.DataFrame arr_2 ["A" "B"] ["C" "D" "E"]))

df_1

    C   D   E
A  30  38  16
B  14  20  44

In [10]:
; Create a DataFrame from multiple pandas Series's inside a Python dictionary
(setv dict_3 {"one" (pd.Series [1., 2., 3.] :index ["a" "b" "c"])
              "two" (pd.Series [1., 2., 3., 4.] :index ["a" "b" "c" "d"])})

(setv df_2 (pd.DataFrame dict_3))
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [11]:
; Create a DataFrame directly from a Python dictionary using .from_dict
(setv df_3 (pd.DataFrame.from_dict (dict [#("A" [1 2 3]) 
                                          #("B" [4 5 6])])))
df_3

   A  B
0  1  4
1  2  5
2  3  6

In [12]:
; Change orientation of a DataFrame by passing :orient "index"; rename columns by passing a list
(setv df_4 (pd.DataFrame.from_dict (dict [#("A" [1 2 3]) 
                                          #("B" [4 5 6])])
                                   :orient "index"
                                   :columns ["one" "two" "three"]))
df_4

   one  two  three
A    1    2      3
B    4    5      6

In [13]:
; Find out number of rows and columns with [DataFrame].shape
df_1.shape

(2, 3)

### Retrieving Data

In [14]:
df_1

    C   D   E
A  30  38  16
B  14  20  44

In [15]:
; Get a single column by passing in the key
(get df_1 "C")

A    30
B    14
Name: C, dtype: int32

In [16]:
; Get multiple columns by passing a list of column keys
(get df_1 ["C" "E"])

    C   E
A  30  16
B  14  44

In [17]:
; Get a row by passing the row key to [DataFrame].loc
(get df_1.loc "A")

C    30
D    38
E    16
Name: A, dtype: int32

In [18]:
; Get a row by passing the index # to [DataFrame].iloc
(get df_1.iloc 1)

C    14
D    20
E    44
Name: B, dtype: int32

In [19]:
; Get specific cell by passing two arguments to [DataFrame].loc
(get df_1.loc "A" "C")

30

In [20]:
; Get multiple cells by passing multiple lists; distributive
(get df_1.loc ["A" "B"] ["C" "D"])

    C   D
A  30  38
B  14  20

### Accessing and Updating Data

In [21]:
; Add a column by simply assigning a value to a column that doesn't exist
(setv (get df_1 "Total") (+ (get df_1 "C") 
                            (get df_1 "D") 
                            (get df_1 "E")))

df_1

    C   D   E  Total
A  30  38  16     84
B  14  20  44     78

In [22]:
; Add a row by [DataFrame].append-ing a new dict
(setv dict_2 {"C" 55 "D" 78 "E" 69})
(setv new_row (pd.Series dict_2 :name "F"))

(setv df_1 (df_1.append new_row))
df_1

    C   D   E  Total
A  30  38  16   84.0
B  14  20  44   78.0
F  55  78  69    NaN

In [23]:
; Remove columns with [DataFrame].drop and :axis 1

(setv df_1 (df_1.drop "Total" :axis 1))
df_1

    C   D   E
A  30  38  16
B  14  20  44
F  55  78  69

In [24]:
; Remove rows with [DataFrame].drop and :axis 0
(setv df_1 (df_1.drop "B" :axis 0))
df_1

    C   D   E
A  30  38  16
F  55  78  69

In [25]:
; Add an index by creating a normal column then marking it as an index
(setv (get df_1 "Sex") ["Men" "Women"])
df_1

    C   D   E    Sex
A  30  38  16    Men
F  55  78  69  Women

In [26]:

; Equivalent way of creating a new column: [DataFrame].assign
(df_1.assign :Sex ["Men" "Women"])

    C   D   E    Sex
A  30  38  16    Men
F  55  78  69  Women

In [27]:
; [DataFrame].assign can take a function as an argument
; - Function is passed in its row
(df_1.assign :example (fn [in] (+ (get in "C")
                                  (get in "D"))))

    C   D   E    Sex  example
A  30  38  16    Men       68
F  55  78  69  Women      133

In [28]:

(setv df_1 (df_1.set_index "Sex"))
df_1

        C   D   E
Sex
Men    30  38  16
Women  55  78  69

In [29]:
; Reset index with [DataFrame].reset_index
(df_1.reset_index)

     Sex   C   D   E
0    Men  30  38  16
1  Women  55  78  69

In [30]:
; Combine dataframes with [DataFrame].combine_first
(setv df_5 (pd.DataFrame {"A" [np.nan 3. np.nan]}))
(setv df_6 (pd.DataFrame {"A" [8. 9. 2. 4.]}))

(setv df_7 (df_5.combine_first df_6))
df_7

     A
0  8.0
1  3.0
2  2.0
3  4.0

### Conditional Selection

In [31]:
; # Example
; Initialize a random NumPy array 
(setv arr_2 (np.random.randint 10 50 :size #(4 3)))

; Create a DataFrame out of the np.array
(setv df_8 (pd.DataFrame arr_2 ["A" "B" "F" "G"] ["C" "D" "E"]))
(print df_8)
(print "\n")

; Values Greater than 40?

(> df_8 30)

    C   D   E
A  37  26  34
B  34  22  45
F  24  32  38
G  39  48  12

       C      D      E
A   True  False   True
B   True  False   True
F  False   True   True
G   True   True  False

In [32]:
; Return only values that match a predicate
; - Values that return false are replaced with NaN

(get df_8 (> df_8 30))

      C     D     E
A  37.0   NaN  34.0
B  34.0   NaN  45.0
F   NaN  32.0  38.0
G  39.0  48.0   NaN

In [33]:
; Return rows where the cell in one row passes a predicate
;
; Equivalent to:
; SELECT * FROM df_8 WHERE df_8["E"] > 30;
;
; Intuition:
; - `>` function on a column returns a list of booleans
; - That list of booleans tells df_8 which rows to return

(print df_8 "\n")
(print (> (get df_8 "E") 30) "\n")

(get df_8 (> (get df_8 "E") 30))

    C   D   E
A  37  26  34
B  34  22  45
F  24  32  38
G  39  48  12

A     True
B     True
F     True
G    False
Name: E, dtype: bool

    C   D   E
A  37  26  34
B  34  22  45
F  24  32  38

In [34]:
; Demonstrating filter by multiple conditions
(setv arr_3 (np.array [[1 2 3] [4 5 6] [7 8 9]]))
(setv df_9 (pd.DataFrame arr_3 ["A" "B" "C"] ["X" "Y" "Z"]))
(print df_9 "\n")

(print (& (> (get df_9 "X") 3) (< (get df_9 "X") 7)) "\n")

(get df_9 (& (> (get df_9 "X") 3) (< (get df_9 "X") 7)))

   X  Y  Z
A  1  2  3
B  4  5  6
C  7  8  9

A    False
B     True
C    False
Name: X, dtype: bool

   X  Y  Z
B  4  5  6

### File Input/Output

#### .csv files

In [35]:
; Read a .csv
(setv cs_df (pd.read_csv "ComputerSales.csv"))
(cs_df.head)

   Sale ID      Contact Sex  Age  ...  Profit     Lead     Month  Year
0        1  Paul Thomas   M   43  ...  143.39  Website   January  2018
1        2  Margo Simms   F   37  ...  230.89  Flyer 4   January  2018
2        3    Sam Stine   M   26  ...  118.64  Website  February  2018
3        4   Moe Eggert   M   35  ...   72.09  Website     March  2018
4        5  Jessica Elk   F   55  ...   98.09  Flyer 4     March  2018

[5 rows x 12 columns]

In [36]:
; Read only a few columns from a .csv
; - Use `:squeeze True` to turn a single column into a Series
(setv cs_df_st_age (pd.read_csv "ComputerSales.csv" 
                                :usecols ["State" "Age"]))
(cs_df_st_age.head)

   Age State
0   43    OH
1   37    WV
2   26    PA
3   35    PA
4   55    PA

In [37]:
; Export a .csv
(cs_df.to_csv "ComputerSales_bak.csv")

#### .xlsx files

In [38]:
; Read a .xlsx 
; - Depends on openpyxl
(setv xlsx_df (pd.read_excel "Financial Sample.xlsx" 0))
(xlsx_df.head)

      Segment  Country    Product  ... Month Number  Month Name  Year
0  Government   Canada  Carretera  ...            1     January  2014
1  Government  Germany  Carretera  ...            1     January  2014
2   Midmarket   France  Carretera  ...            6        June  2014
3   Midmarket  Germany  Carretera  ...            6        June  2014
4   Midmarket   Mexico  Carretera  ...            6        June  2014

[5 rows x 16 columns]

In [39]:
; Save to a .xlsx
(xlsx_df.to_excel "Financial Sample_bak.xlsx")

#### MySQL Databases

In [40]:
(import pymysql)

In [41]:
; Connect to and get SQL from MySQL database
(try 
  (setv db_connection (pymysql.connect :db "students"
                                       :user "studentadmin"
                                       :passwd "TurtleDove"
                                       :host "localhost"
                                       :port 3306))
  (setv student_df (pd.read_sql "SELECT * FROM students" 
                                :con db_connection))
  (except [e Exception]
    (print (. "Exception : {}" (format e))))
  (else (db_connection.close)))

Exception : (2003, "Can't connect to MySQL server on 'localhost' ([WinError 10061] No connection could be made because the target machine actively refused it)")

In [42]:
; Insert into a MySQL database
(try 
  (setv db_connection (pymysql.connect :db "students"
                                       :user "studentadmin"
                                       :passwd "TurtleDove"
                                       :host "localhost"
                                       :port 3306))
  (setv cursor (db_connection.cursor))
  (setv insert_stmd "INSERT INTO students VALUES()")
  (cursor.execute insert_stmt)
  (db_connection.commit)
  (setv student_df (pd.read_sql "SELECT * FROM students"
                                :con db_connection))
  (except [e Exception]
    (print (. "Exception : {}" (format e))))
  (else (db_connection.close)))

Exception : (2003, "Can't connect to MySQL server on 'localhost' ([WinError 10061] No connection could be made because the target machine actively refused it)")

#### SQLite Databases

In [43]:
(import sqlite3)

In [44]:
; Connect to database, create cursor
(setv con (sqlite3.connect "hy-pandas.db"))
(setv sqlite_cursor (con.cursor))

In [45]:
; Create icecreamsales table, deleting if already created
(sqlite_cursor.execute "DROP TABLE IF EXISTS icecreamsales")
(sqlite_cursor.execute "CREATE TABLE IF NOT EXISTS icecreamsales(id primary key, temperature, sales)")

In [46]:

; Load up icecreamsales.csv into a pandas DataFrame
(setv sqlite_icecreamsales_csv (pd.read_csv "icecreamsales.csv"))
(sqlite_icecreamsales_csv.head)

   Temperature  Sales
0           37    292
1           40    228
2           49    324
3           61    376
4           72    440

In [47]:

; Iterate over icecreamsales DataFrame inserting into database one row at a time
; - Calling .item on row.Temperature and row.Sales turns numpy Int64 into standard python Int
(for [[index row] (sqlite_icecreamsales_csv.iterrows)]
    (sqlite_cursor.execute "INSERT OR REPLACE INTO icecreamsales VALUES(?, ?, ?)" 
                           #(index (row.Temperature.item) (row.Sales.item))))

; Commit inserts; no changes actually happen until this point
(con.commit)

In [48]:
; Alternate method of inserting: [SQLite Cursor].executemany
(let [data (sqlite_icecreamsales_csv.itertuples)] 
  ; - .itertuples returns an iterator over the rows in a dataframe as tuples
  ; - The `parameters` argument to .executemany expects a list or iterator of tuples
  (sqlite_cursor.executemany "INSERT OR REPLACE INTO icecreamsales VALUES(?, ?, ?)" data))

(con.commit)

In [49]:
; Query sqlite database
(setv sqlite_select (pd.read_sql_query "SELECT * FROM icecreamsales" 
                                       :con con))
sqlite_select

    id  temperature  sales
0    0           37    292
1    1           40    228
2    2           49    324
3    3           61    376
4    4           72    440
5    5           79    496
6    6           83    536
7    7           81    556
8    8           75    496
9    9           64    412
10  10           53    324
11  11           40    320

### NumPy Conversion

In [72]:
; Convert a pandas DataFrame to a numpy array
(setv short_df (cs_df.head))
(short_df.to_numpy)

array([[1, 'Paul Thomas', 'M', 43, 'OH', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Website', 'January', 2018],
       [2, 'Margo Simms', 'F', 37, 'WV', 'GT13-0024', 'Desktop', 1249.99,
        230.89, 'Flyer 4', 'January', 2018],
       [3, 'Sam Stine', 'M', 26, 'PA', 'I3670', 'Desktop', 649.99,
        118.64, 'Website', 'February', 2018],
       [4, 'Moe Eggert', 'M', 35, 'PA', 'I3593', 'Laptop', 399.99, 72.09,
        'Website', 'March', 2018],
       [5, 'Jessica Elk', 'F', 55, 'PA', '15M-ED', 'Laptop', 699.99,
        98.09, 'Flyer 4', 'March', 2018]], dtype=object)

## DataFrame Manipulation and Analysis

### Basics & Math

In [51]:
(setv cs_df (pd.read_csv "ComputerSales.csv"))

; Get first five rows
(cs_df.head)

   Sale ID      Contact Sex  Age  ...  Profit     Lead     Month  Year
0        1  Paul Thomas   M   43  ...  143.39  Website   January  2018
1        2  Margo Simms   F   37  ...  230.89  Flyer 4   January  2018
2        3    Sam Stine   M   26  ...  118.64  Website  February  2018
3        4   Moe Eggert   M   35  ...   72.09  Website     March  2018
4        5  Jessica Elk   F   55  ...   98.09  Flyer 4     March  2018

[5 rows x 12 columns]

In [52]:
; Get last five rows
(cs_df.tail)

    Sale ID          Contact Sex  Age  ...  Profit     Lead  Month  Year
34       35   Michelle Samms   F   46  ...  146.69  Website  April  2020
35       36  Sally Struthers   F   45  ...  122.34  Website  April  2020
36       37       Jason Case   M   57  ...  143.39  Flyer 4  April  2020
37       38     Doug Johnson   M   51  ...  180.34  Website    May  2020
38       39       Moe Eggert   M   35  ...   72.09  Website    May  2020

[5 rows x 12 columns]

In [55]:
; Get an arbitrary slice using `cut` (Hy)
(cut cs_df 2)

   Sale ID      Contact Sex  Age  ...  Profit     Lead    Month  Year
0        1  Paul Thomas   M   43  ...  143.39  Website  January  2018
1        2  Margo Simms   F   37  ...  230.89  Flyer 4  January  2018

[2 rows x 12 columns]

In [89]:
; Step through at an interval
; - 0 indicates start of list
; - Negative index of -1 indicates very end of list
; - 2 indicates interval to step through
(cut cs_df 0 -1 4)

    Sale ID         Contact Sex  Age  ...  Profit     Lead     Month  Year
0         1     Paul Thomas   M   43  ...  143.39  Website   January  2018
4         5     Jessica Elk   F   55  ...   98.09  Flyer 4     March  2018
8         9     Ed Klondike   M   52  ...  122.34    Email      July  2018
12       13      Jason Case   M   57  ...  122.34    Email  November  2018
16       17    Edna Sanders   F   46  ...   98.09    Email  February  2019
20       21      Jason Case   M   57  ...  143.39  Flyer 4       May  2019
24       25  Michelle Samms   F   46  ...  118.64  Flyer 2  November  2019
28       29     Jessica Elk   F   55  ...  180.34  Flyer 2  December  2019
32       33     Kim Collins   F   49  ...   72.09  Flyer 2     March  2020
36       37      Jason Case   M   57  ...  143.39  Flyer 4     April  2020

[10 rows x 12 columns]

In [87]:
; Access details about DataFrame's index
cs_df.index

RangeIndex(start=0, stop=39, step=1)

In [88]:
; Convert DataFrame index into a pandas array (more useful when index is not a simple ennumeration from 0 to the length of the DataFrame)
cs_df.index.array

<PandasArray>
[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
 38]
Length: 39, dtype: int64

### Group Data

### Concatenate Merge & Join Data

### Statistics

### Iteration